IDEA StatiCa Open Model
Stirrup.Geometry Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Geometry
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public PolyLine2D Geometry { get; set; }
Public Property Geometry As PolyLine2D
	Get
	Set
public:
property PolyLine2D^ Geometry {
	PolyLine2D^ get ();
	void set (PolyLine2D^ value);
}
Property Value
Type: PolyLine2D
See Also
Reference
Stirrup Class
IdeaRS.OpenModel.CrossSection Namespace